[Timeout] StringLiteral
src/mock/server.js:18:3
   'Капитан',
   'Стас',
   'Жили-были',
-  'Docker',
+  "",
   'Спарта',
   'Нагибатор',

[Timeout] ArithmeticOperator
src/mock/server.js:22:34
   'Спарта',
   'Нагибатор',
 ];
-const random = () => (Math.floor(Math.random() * USERS.length));
+const random = () => (Math.floor(Math.random() / USERS.length));
 const getUser = () => {
   const r = random();

[Timeout] ArrowFunction
src/mock/server.js:22:16
   'Спарта',
   'Нагибатор',
 ];
-const random = () => (Math.floor(Math.random() * USERS.length));
+const random = () => undefined;
 const getUser = () => {
   const r = random();

[Timeout] BlockStatement
src/mock/server.js:23:23
   'Нагибатор',
 ];
 const random = () => (Math.floor(Math.random() * USERS.length));
-const getUser = () => {
-  const r = random();
-  return USERS[r];
-}
+const getUser = () => {}
 
 app.use(cors());

[Timeout] BlockStatement
src/mock/server.js:30:33
 
 app.use(cors());
 
-app.get('/users', (req, res) => {
-  res.send({
-    userA: getUser(),
-    userB: getUser(),
-  })
-})
+app.get('/users', (req, res) => {})
 
 app.get('/update', (req, res) => {

[Timeout] BlockStatement
src/mock/server.js:37:34
   })
 })
 
-app.get('/update', (req, res) => {
-  res.send({
-    success: true,
-    errors: [],
-  })
-})
+app.get('/update', (req, res) => {})
 
 app.get('/rating', (req, res) => {

[Timeout] BooleanLiteral
src/mock/server.js:39:14
 
 app.get('/update', (req, res) => {
   res.send({
-    success: true,
+    success: false,
     errors: [],
   })

[Timeout] BlockStatement
src/mock/server.js:44:34
   })
 })
 
-app.get('/rating', (req, res) => {
-  const rating = [];
-  for (let i = 0; i < 10; i++) {
-    rating.push({
-      name: getUser(),
-      points: Math.floor(Math.random() * 100),
-    });
-  }
-  res.send({ rating, errors: [] })
-})
+app.get('/rating', (req, res) => {})
 
 app.listen(port, () => {

[Timeout] BlockStatement
src/mock/server.js:46:32
 
 app.get('/rating', (req, res) => {
   const rating = [];
-  for (let i = 0; i < 10; i++) {
-    rating.push({
-      name: getUser(),
-      points: Math.floor(Math.random() * 100),
-    });
-  }
+  for (let i = 0; i < 10; i++) {}
   res.send({ rating, errors: [] })
 })

[Timeout] EqualityOperator
src/mock/server.js:46:19
 
 app.get('/rating', (req, res) => {
   const rating = [];
-  for (let i = 0; i < 10; i++) {
+  for (let i = 0; i <= 10; i++) {
     rating.push({
       name: getUser(),

[Timeout] ArithmeticOperator
src/mock/server.js:49:26
   for (let i = 0; i < 10; i++) {
     rating.push({
       name: getUser(),
-      points: Math.floor(Math.random() * 100),
+      points: Math.floor(Math.random() / 100),
     });
   }

[Timeout] ArrayDeclaration
src/mock/server.js:52:30
       points: Math.floor(Math.random() * 100),
     });
   }
-  res.send({ rating, errors: [] })
+  res.send({ rating, errors: ["Stryker was here"] })
 })
 

[Timeout] BlockStatement
src/mock/server.js:55:24
   res.send({ rating, errors: [] })
 })
 
-app.listen(port, () => {
-  console.log(`Example app listening on port ${port}`)
-})
+app.listen(port, () => {})
