[Timeout] StringLiteral
src/lesson-2/helper/calculation.ts:5:18
 import { isEnd, isNumber, isOperator } from './helper';
 
 const multiplication = '*';
-const division = '/';
+const division = "";
 
 export const getStack = (str: string) => {

[Timeout] BooleanLiteral
src/lesson-2/helper/calculation.ts:9:22
 
 export const getStack = (str: string) => {
   const values = str.split(' ');
-  let mustByNumber = true;
+  let mustByNumber = false;
 
   return values.reduce((acc: string[], elm: string) => {

[Timeout] BlockStatement
src/lesson-2/helper/calculation.ts:12:45
   let mustByNumber = true;
 
   return values.reduce((acc: string[], elm: string) => {
-    if (!isOperator(elm) && !isNumber(elm)) {
-      throw new Error(`Invalid value in response: ${elm}`);
-    }
+    if (!isOperator(elm) && !isNumber(elm)) {}
 
     if (mustByNumber && !isNumber(elm)) {

[Timeout] BooleanLiteral
src/lesson-2/helper/calculation.ts:12:9
   let mustByNumber = true;
 
   return values.reduce((acc: string[], elm: string) => {
-    if (!isOperator(elm) && !isNumber(elm)) {
+    if (isOperator(elm) && !isNumber(elm)) {
       throw new Error(`Invalid value in response: ${elm}`);
     }

[Timeout] StringLiteral
src/lesson-2/helper/calculation.ts:13:23
 
   return values.reduce((acc: string[], elm: string) => {
     if (!isOperator(elm) && !isNumber(elm)) {
-      throw new Error(`Invalid value in response: ${elm}`);
+      throw new Error(``);
     }
 

[Timeout] ConditionalExpression
src/lesson-2/helper/calculation.ts:16:9
       throw new Error(`Invalid value in response: ${elm}`);
     }
 
-    if (mustByNumber && !isNumber(elm)) {
+    if (false) {
       throw new Error(`Value '${elm}' must by a number`);
     }

[Timeout] LogicalOperator
src/lesson-2/helper/calculation.ts:16:9
       throw new Error(`Invalid value in response: ${elm}`);
     }
 
-    if (mustByNumber && !isNumber(elm)) {
+    if (mustByNumber || !isNumber(elm)) {
       throw new Error(`Value '${elm}' must by a number`);
     }

[Timeout] BlockStatement
src/lesson-2/helper/calculation.ts:20:44
       throw new Error(`Value '${elm}' must by a number`);
     }
 
-    if (!mustByNumber && !isOperator(elm)) {
-      throw new Error(`Value '${elm}' must by a operator`);
-    }
+    if (!mustByNumber && !isOperator(elm)) {}
 
     mustByNumber = !mustByNumber;

[Timeout] LogicalOperator
src/lesson-2/helper/calculation.ts:20:9
       throw new Error(`Value '${elm}' must by a number`);
     }
 
-    if (!mustByNumber && !isOperator(elm)) {
+    if (!mustByNumber || !isOperator(elm)) {
       throw new Error(`Value '${elm}' must by a operator`);
     }

[Timeout] StringLiteral
src/lesson-2/helper/calculation.ts:21:23
     }
 
     if (!mustByNumber && !isOperator(elm)) {
-      throw new Error(`Value '${elm}' must by a operator`);
+      throw new Error(``);
     }
 

[Timeout] BooleanLiteral
src/lesson-2/helper/calculation.ts:24:20
       throw new Error(`Value '${elm}' must by a operator`);
     }
 
-    mustByNumber = !mustByNumber;
+    mustByNumber = mustByNumber;
 
     acc.push(elm);

[Timeout] ArrayDeclaration
src/lesson-2/helper/calculation.ts:28:6
 
     acc.push(elm);
     return acc;
-  }, []);
+  }, ["Stryker was here"]);
 };
 

[Timeout] UnaryOperator
src/lesson-2/helper/calculation.ts:32:16
 };
 
 export const plusOrMinus = (arr: string[]): number => {
-  let result = +arr[0] | 0;
+  let result = -arr[0] | 0;
 
   for (let i = 1; i < arr.length; i += 2) {

[Timeout] AssignmentOperator
src/lesson-2/helper/calculation.ts:34:35
 export const plusOrMinus = (arr: string[]): number => {
   let result = +arr[0] | 0;
 
-  for (let i = 1; i < arr.length; i += 2) {
+  for (let i = 1; i < arr.length; i -= 2) {
     const op: Operator = arr[i] as Operator;
     const fn: OperationFn = mathFunctions[op];

[Timeout] ConditionalExpression
src/lesson-2/helper/calculation.ts:34:19
 export const plusOrMinus = (arr: string[]): number => {
   let result = +arr[0] | 0;
 
-  for (let i = 1; i < arr.length; i += 2) {
+  for (let i = 1; false; i += 2) {
     const op: Operator = arr[i] as Operator;
     const fn: OperationFn = mathFunctions[op];

[Timeout] ArithmeticOperator
src/lesson-2/helper/calculation.ts:37:31
   for (let i = 1; i < arr.length; i += 2) {
     const op: Operator = arr[i] as Operator;
     const fn: OperationFn = mathFunctions[op];
-    result = fn(+result, +arr[i + 1]);
+    result = fn(+result, +arr[i - 1]);
   }
 

[Timeout] UnaryOperator
src/lesson-2/helper/calculation.ts:37:26
   for (let i = 1; i < arr.length; i += 2) {
     const op: Operator = arr[i] as Operator;
     const fn: OperationFn = mathFunctions[op];
-    result = fn(+result, +arr[i + 1]);
+    result = fn(+result, -arr[i + 1]);
   }
 

[Timeout] LogicalOperator
src/lesson-2/helper/calculation.ts:44:7
 };
 
 export const multiOrDivision = (arr: string[]): string[] => {
-  if (!arr.includes(multiplication) && !arr.includes(division)) {
+  if (!arr.includes(multiplication) || !arr.includes(division)) {
     return arr;
   }

[Timeout] BooleanLiteral
src/lesson-2/helper/calculation.ts:44:7
 };
 
 export const multiOrDivision = (arr: string[]): string[] => {
-  if (!arr.includes(multiplication) && !arr.includes(division)) {
+  if (arr.includes(multiplication) && !arr.includes(division)) {
     return arr;
   }

[Timeout] BlockStatement
src/lesson-2/helper/calculation.ts:51:43
   const result = [];
   let temp = 0;
 
-  for (let i = 1; i < arr.length; i += 2) {
-    const elm = arr[i];
-
-    if (elm === division || elm === multiplication) {
-      const op: Operator = arr[i] as Operator;
-      const fn: OperationFn = mathFunctions[op];
-
-      const a = temp ? +temp : +arr[i - 1];
-      const b = +arr[i + 1];
-      temp = fn(a, b);
-
-      isEnd(i, arr) && result.push(temp.toString());
-      continue;
-    }
-
-    result.push(temp ? temp.toString() : arr[i - 1]);
-    result.push(arr[i]);
-    temp = 0;
-
-    isEnd(i, arr) && result.push(arr[i + 1]);
-  }
+  for (let i = 1; i < arr.length; i += 2) {}
 
   return result;

[Timeout] EqualityOperator
src/lesson-2/helper/calculation.ts:51:19
   const result = [];
   let temp = 0;
 
-  for (let i = 1; i < arr.length; i += 2) {
+  for (let i = 1; i <= arr.length; i += 2) {
     const elm = arr[i];
 

[Timeout] ConditionalExpression
src/lesson-2/helper/calculation.ts:54:29
   for (let i = 1; i < arr.length; i += 2) {
     const elm = arr[i];
 
-    if (elm === division || elm === multiplication) {
+    if (elm === division || false) {
       const op: Operator = arr[i] as Operator;
       const fn: OperationFn = mathFunctions[op];

[Timeout] ConditionalExpression
src/lesson-2/helper/calculation.ts:54:9
   for (let i = 1; i < arr.length; i += 2) {
     const elm = arr[i];
 
-    if (elm === division || elm === multiplication) {
+    if (true) {
       const op: Operator = arr[i] as Operator;
       const fn: OperationFn = mathFunctions[op];

[Timeout] UnaryOperator
src/lesson-2/helper/calculation.ts:58:32
       const op: Operator = arr[i] as Operator;
       const fn: OperationFn = mathFunctions[op];
 
-      const a = temp ? +temp : +arr[i - 1];
+      const a = temp ? +temp : -arr[i - 1];
       const b = +arr[i + 1];
       temp = fn(a, b);

[Timeout] ArithmeticOperator
src/lesson-2/helper/calculation.ts:58:37
       const op: Operator = arr[i] as Operator;
       const fn: OperationFn = mathFunctions[op];
 
-      const a = temp ? +temp : +arr[i - 1];
+      const a = temp ? +temp : +arr[i + 1];
       const b = +arr[i + 1];
       temp = fn(a, b);

[Timeout] UnaryOperator
src/lesson-2/helper/calculation.ts:59:17
       const fn: OperationFn = mathFunctions[op];
 
       const a = temp ? +temp : +arr[i - 1];
-      const b = +arr[i + 1];
+      const b = -arr[i + 1];
       temp = fn(a, b);
 

[Timeout] ArithmeticOperator
src/lesson-2/helper/calculation.ts:59:22
       const fn: OperationFn = mathFunctions[op];
 
       const a = temp ? +temp : +arr[i - 1];
-      const b = +arr[i + 1];
+      const b = +arr[i - 1];
       temp = fn(a, b);
 

[Timeout] ConditionalExpression
src/lesson-2/helper/calculation.ts:62:7
       const b = +arr[i + 1];
       temp = fn(a, b);
 
-      isEnd(i, arr) && result.push(temp.toString());
+      true;
       continue;
     }

[Timeout] ConditionalExpression
src/lesson-2/helper/calculation.ts:62:7
       const b = +arr[i + 1];
       temp = fn(a, b);
 
-      isEnd(i, arr) && result.push(temp.toString());
+      false;
       continue;
     }

[Timeout] ArithmeticOperator
src/lesson-2/helper/calculation.ts:66:46
       continue;
     }
 
-    result.push(temp ? temp.toString() : arr[i - 1]);
+    result.push(temp ? temp.toString() : arr[i + 1]);
     result.push(arr[i]);
     temp = 0;

[Timeout] ConditionalExpression
src/lesson-2/helper/calculation.ts:70:5
     result.push(arr[i]);
     temp = 0;
 
-    isEnd(i, arr) && result.push(arr[i + 1]);
+    false;
   }
 

[Timeout] LogicalOperator
src/lesson-2/helper/calculation.ts:70:5
     result.push(arr[i]);
     temp = 0;
 
-    isEnd(i, arr) && result.push(arr[i + 1]);
+    isEnd(i, arr) || result.push(arr[i + 1]);
   }
 

[Timeout] BlockStatement
src/lesson-2/helper/calculation.ts:76:47
   return result;
 };
 
-export const calculation = (value: string) => {
-  const stack = getStack(value);
-
-  const updatedStack = multiOrDivision(stack);
-  const result = plusOrMinus(updatedStack);
-  console.log('> ', result);
-};
+export const calculation = (value: string) => {};
 

[Timeout] StringLiteral
src/lesson-2/helper/calculation.ts:81:15
 
   const updatedStack = multiOrDivision(stack);
   const result = plusOrMinus(updatedStack);
-  console.log('> ', result);
+  console.log("", result);
 };
 
