[Timeout] BooleanLiteral
src/App.tsx:14:29
       {/*<Navigation />*/}
       <BrowserRouter basename="react-developer-2023">
         <Provider store={store}>
-          <Rating testMode={false} />
+          <Rating testMode={true} />
         </Provider>
       </BrowserRouter>
