[Timeout] BlockStatement
src/lesson-10/easy1.ts:22:36
   orderStates: OrderState[],
 ): Array<OrderState> => {
   const filteredStates = [] as Array<OrderState>;
-  orderStates.forEach((element) => {
-    if (element !== 'buyingSupplies' && element !== 'producing') {
-      filteredStates.push(element);
-    }
-  });
+  orderStates.forEach((element) => {});
   return filteredStates;
 };

[Timeout] EqualityOperator
src/lesson-10/easy1.ts:23:41
 ): Array<OrderState> => {
   const filteredStates = [] as Array<OrderState>;
   orderStates.forEach((element) => {
-    if (element !== 'buyingSupplies' && element !== 'producing') {
+    if (element !== 'buyingSupplies' && element === 'producing') {
       filteredStates.push(element);
     }

[Timeout] BlockStatement
src/lesson-10/easy1.ts:23:66
 ): Array<OrderState> => {
   const filteredStates = [] as Array<OrderState>;
   orderStates.forEach((element) => {
-    if (element !== 'buyingSupplies' && element !== 'producing') {
-      filteredStates.push(element);
-    }
+    if (element !== 'buyingSupplies' && element !== 'producing') {}
   });
   return filteredStates;
