[Timeout] BooleanLiteral
src/components/Enter/Enter.tsx:12:42
 } from '../styles/components';
 
 export const Enter: FC = () => {
-  const [entered, setEntered] = useState(false);
+  const [entered, setEntered] = useState(true);
   const onSubmit = () => {
     setEntered(true);

[Timeout] BlockStatement
src/components/Enter/Enter.tsx:13:26
 
 export const Enter: FC = () => {
   const [entered, setEntered] = useState(false);
-  const onSubmit = () => {
-    setEntered(true);
-  };
+  const onSubmit = () => {};
 
   return (

[Timeout] BooleanLiteral
src/components/Enter/Enter.tsx:14:16
 export const Enter: FC = () => {
   const [entered, setEntered] = useState(false);
   const onSubmit = () => {
-    setEntered(true);
+    setEntered(false);
   };
 

[Timeout] BooleanLiteral
src/components/Enter/Enter.tsx:32:53
         </StyledEnterForm>
       </div>
 
-      <div>{entered && <Navigate to="game" replace={true} />}</div>
+      <div>{entered && <Navigate to="game" replace={false} />}</div>
     </>
   );

[Timeout] LogicalOperator
src/components/Enter/Enter.tsx:32:13
         </StyledEnterForm>
       </div>
 
-      <div>{entered && <Navigate to="game" replace={true} />}</div>
+      <div>{entered || <Navigate to="game" replace={true} />}</div>
     </>
   );
