[Timeout] BooleanLiteral
src/store/redux/reducer.ts:4:16
 import { InitialStoreType } from '../types';
 
 const initialState: InitialStoreType = {
-  loadingList: false,
+  loadingList: true,
   loadingInfo: false,
   ratingList: [],

[Timeout] BooleanLiteral
src/store/redux/reducer.ts:5:16
 
 const initialState: InitialStoreType = {
   loadingList: false,
-  loadingInfo: false,
+  loadingInfo: true,
   ratingList: [],
   info: {

[Timeout] ArrayDeclaration
src/store/redux/reducer.ts:6:15
 const initialState: InitialStoreType = {
   loadingList: false,
   loadingInfo: false,
-  ratingList: [],
+  ratingList: ["Stryker was here"],
   info: {
     name: 'no',

[Timeout] ArrayDeclaration
src/store/redux/reducer.ts:11:16
     name: 'no',
     weight: 0,
     height: 0,
-    abilities: [],
+    abilities: ["Stryker was here"],
   },
   errorList: null,

[Timeout] BlockStatement
src/store/redux/reducer.ts:19:26
 
 const rootReducer = (state = initialState, action) => {
   switch (action.type) {
-    case 'LOADING_LIST': {
-      return {
-        ...state,
-        loadingList: true,
-        errorList: null,
-      };
-    }
+    case 'LOADING_LIST': {}
     case 'GET_LIST': {
       return {

[Timeout] ConditionalExpression
src/store/redux/reducer.ts:19:5
 
 const rootReducer = (state = initialState, action) => {
   switch (action.type) {
-    case 'LOADING_LIST': {
-      return {
-        ...state,
-        loadingList: true,
-        errorList: null,
-      };
-    }
+    case 'LOADING_LIST':
     case 'GET_LIST': {
       return {

[Timeout] BooleanLiteral
src/store/redux/reducer.ts:22:22
     case 'LOADING_LIST': {
       return {
         ...state,
-        loadingList: true,
+        loadingList: false,
         errorList: null,
       };

[Timeout] ConditionalExpression
src/store/redux/reducer.ts:26:5
         errorList: null,
       };
     }
-    case 'GET_LIST': {
-      return {
-        ...state,
-        ratingList: action.payload,
-        loadingList: false,
-        errorList: null,
-      };
-    }
+    case 'GET_LIST':
     case 'LIST_ERROR': {
       return {

[Timeout] BlockStatement
src/store/redux/reducer.ts:26:22
         errorList: null,
       };
     }
-    case 'GET_LIST': {
-      return {
-        ...state,
-        ratingList: action.payload,
-        loadingList: false,
-        errorList: null,
-      };
-    }
+    case 'GET_LIST': {}
     case 'LIST_ERROR': {
       return {

[Timeout] BooleanLiteral
src/store/redux/reducer.ts:30:22
       return {
         ...state,
         ratingList: action.payload,
-        loadingList: false,
+        loadingList: true,
         errorList: null,
       };

[Timeout] ConditionalExpression
src/store/redux/reducer.ts:34:5
         errorList: null,
       };
     }
-    case 'LIST_ERROR': {
-      return {
-        ...state,
-        errorList: action.payload.message,
-      };
-    }
+    case 'LIST_ERROR':
     case 'LOADING_INFO': {
       return {

[Timeout] BlockStatement
src/store/redux/reducer.ts:34:24
         errorList: null,
       };
     }
-    case 'LIST_ERROR': {
-      return {
-        ...state,
-        errorList: action.payload.message,
-      };
-    }
+    case 'LIST_ERROR': {}
     case 'LOADING_INFO': {
       return {

[Timeout] ConditionalExpression
src/store/redux/reducer.ts:40:5
         errorList: action.payload.message,
       };
     }
-    case 'LOADING_INFO': {
-      return {
-        ...state,
-        loadingInfo: true,
-        errorInfo: null,
-      };
-    }
+    case 'LOADING_INFO':
     case 'GET_INFO': {
       return {

[Timeout] BlockStatement
src/store/redux/reducer.ts:40:26
         errorList: action.payload.message,
       };
     }
-    case 'LOADING_INFO': {
-      return {
-        ...state,
-        loadingInfo: true,
-        errorInfo: null,
-      };
-    }
+    case 'LOADING_INFO': {}
     case 'GET_INFO': {
       return {

[Timeout] BooleanLiteral
src/store/redux/reducer.ts:43:22
     case 'LOADING_INFO': {
       return {
         ...state,
-        loadingInfo: true,
+        loadingInfo: false,
         errorInfo: null,
       };

[Timeout] ConditionalExpression
src/store/redux/reducer.ts:47:5
         errorInfo: null,
       };
     }
-    case 'GET_INFO': {
-      return {
-        ...state,
-        info: action.payload,
-        loadingInfo: false,
-        errorInfo: null,
-      };
-    }
+    case 'GET_INFO':
     case 'INFO_ERROR': {
       return {

[Timeout] BlockStatement
src/store/redux/reducer.ts:47:22
         errorInfo: null,
       };
     }
-    case 'GET_INFO': {
-      return {
-        ...state,
-        info: action.payload,
-        loadingInfo: false,
-        errorInfo: null,
-      };
-    }
+    case 'GET_INFO': {}
     case 'INFO_ERROR': {
       return {

[Timeout] BooleanLiteral
src/store/redux/reducer.ts:51:22
       return {
         ...state,
         info: action.payload,
-        loadingInfo: false,
+        loadingInfo: true,
         errorInfo: null,
       };

[Timeout] BlockStatement
src/store/redux/reducer.ts:55:24
         errorInfo: null,
       };
     }
-    case 'INFO_ERROR': {
-      return {
-        ...state,
-        errorInfo: action.payload.message,
-      };
-    }
+    case 'INFO_ERROR': {}
     default:
       return state;

[Timeout] ConditionalExpression
src/store/redux/reducer.ts:55:5
         errorInfo: null,
       };
     }
-    case 'INFO_ERROR': {
-      return {
-        ...state,
-        errorInfo: action.payload.message,
-      };
-    }
+    case 'INFO_ERROR':
     default:
       return state;

[Timeout] ConditionalExpression
src/store/redux/reducer.ts:61:5
         errorInfo: action.payload.message,
       };
     }
-    default:
-      return state;
+    default:
   }
 };
