[Timeout] BlockStatement
src/components/Form/Form.tsx:18:31
 };
 
 const Form = ({ onStart, onSize }) => {
-  const onSubmit = (event) => {
-    event.preventDefault();
-    const { myRadio, fillings, maxStartPoints } =
-      event.target.elements;
-    const data: StartDataType = {
-      size: myRadio.value,
-      fillings: fillings.value,
-      maxStartPoints: maxStartPoints.value,
-    };
-    console.log(data);
-    onStart(data);
-
-    const elements = myRadio.value.split('x').map((elm) => +elm);
-    const newArr = getRandomArray(
-      elements[0] * elements[1],
-      +data.fillings,
-      +data.maxStartPoints,
-    );
-    onSize(newArr);
-  };
+  const onSubmit = (event) => {};
 
   return (

[Timeout] UnaryOperator
src/components/Form/Form.tsx:30:60
     console.log(data);
     onStart(data);
 
-    const elements = myRadio.value.split('x').map((elm) => +elm);
+    const elements = myRadio.value.split('x').map((elm) => -elm);
     const newArr = getRandomArray(
       elements[0] * elements[1],

[Timeout] ArrowFunction
src/components/Form/Form.tsx:30:51
     console.log(data);
     onStart(data);
 
-    const elements = myRadio.value.split('x').map((elm) => +elm);
+    const elements = myRadio.value.split('x').map(() => undefined);
     const newArr = getRandomArray(
       elements[0] * elements[1],

[Timeout] ArithmeticOperator
src/components/Form/Form.tsx:32:7
 
     const elements = myRadio.value.split('x').map((elm) => +elm);
     const newArr = getRandomArray(
-      elements[0] * elements[1],
+      elements[0] / elements[1],
       +data.fillings,
       +data.maxStartPoints,

[Timeout] UnaryOperator
src/components/Form/Form.tsx:33:7
     const elements = myRadio.value.split('x').map((elm) => +elm);
     const newArr = getRandomArray(
       elements[0] * elements[1],
-      +data.fillings,
+      -data.fillings,
       +data.maxStartPoints,
     );

[Timeout] UnaryOperator
src/components/Form/Form.tsx:34:7
     const newArr = getRandomArray(
       elements[0] * elements[1],
       +data.fillings,
-      +data.maxStartPoints,
+      -data.maxStartPoints,
     );
     onSize(newArr);

[Timeout] BooleanLiteral
src/components/Form/Form.tsx:62:31
               name="myRadio"
               value="4x4"
               role="Input"
-              defaultChecked={true}
+              defaultChecked={false}
             />{' '}
             4x4
