[Timeout] BooleanLiteral
src/components/Rating/Rating.tsx:16:30
   errorInfo: null;
 };
 
-const Rating = ({ testMode = true }) => {
+const Rating = ({ testMode = false }) => {
   const dispatch = useDispatch();
   const { loadingList, loadingInfo, ratingList, info, errorList, errorInfo } =

[Timeout] ArrowFunction
src/components/Rating/Rating.tsx:19:17
 const Rating = ({ testMode = true }) => {
   const dispatch = useDispatch();
   const { loadingList, loadingInfo, ratingList, info, errorList, errorInfo } =
-    useSelector((state: State) => state);
+    useSelector(() => undefined);
 
   useEffect(() => {

[Timeout] BlockStatement
src/components/Rating/Rating.tsx:21:19
   const { loadingList, loadingInfo, ratingList, info, errorList, errorInfo } =
     useSelector((state: State) => state);
 
-  useEffect(() => {
-    // @ts-ignore
-    dispatch(getRatingThunk(testMode));
-  }, []);
+  useEffect(() => {}, []);
 
   const click = () => {

[Timeout] BlockStatement
src/components/Rating/Rating.tsx:26:23
     dispatch(getRatingThunk(testMode));
   }, []);
 
-  const click = () => {
-    dispatch({ type: 'LOADING_LIST' });
-    // @ts-ignore
-    dispatch(getRatingThunk());
-  };
+  const click = () => {};
 
   const getInfo = (params) => {

[Timeout] StringLiteral
src/components/Rating/Rating.tsx:27:22
   }, []);
 
   const click = () => {
-    dispatch({ type: 'LOADING_LIST' });
+    dispatch({ type: "" });
     // @ts-ignore
     dispatch(getRatingThunk());

[Timeout] BlockStatement
src/components/Rating/Rating.tsx:32:31
     dispatch(getRatingThunk());
   };
 
-  const getInfo = (params) => {
-    dispatch({ type: 'LOADING_INFO' });
-    // @ts-ignore
-    dispatch(getInfoThunk(params));
-  };
+  const getInfo = (params) => {};
 
   return (

[Timeout] ConditionalExpression
src/components/Rating/Rating.tsx:45:15
       </div>
 
       <div className="rating-block" role="rating-list">
-        <div>{errorList && <div>{JSON.stringify(errorList)}</div>}</div>
+        <div>{true}</div>
         {loadingList ? (
           <div>LOADING...</div>

[Timeout] LogicalOperator
src/components/Rating/Rating.tsx:45:15
       </div>
 
       <div className="rating-block" role="rating-list">
-        <div>{errorList && <div>{JSON.stringify(errorList)}</div>}</div>
+        <div>{errorList || <div>{JSON.stringify(errorList)}</div>}</div>
         {loadingList ? (
           <div>LOADING...</div>

[Timeout] ArrowFunction
src/components/Rating/Rating.tsx:50:29
           <div>LOADING...</div>
         ) : (
           <div role="Rating" className="rating">
-            {ratingList.map(({ name, url }, i) => (
-              <div key={url} className="line">
-                <Button text="info" type="eco" onClick={() => getInfo(url)} />
-                <div role="RatingRaw" className="rating-raw">{`${
-                  i + 1
-                } ${name}`}</div>
-              </div>
-            ))}
+            {ratingList.map(() => undefined)}
           </div>
         )}

[Timeout] ArrowFunction
src/components/Rating/Rating.tsx:52:57
           <div role="Rating" className="rating">
             {ratingList.map(({ name, url }, i) => (
               <div key={url} className="line">
-                <Button text="info" type="eco" onClick={() => getInfo(url)} />
+                <Button text="info" type="eco" onClick={() => undefined} />
                 <div role="RatingRaw" className="rating-raw">{`${
                   i + 1

[Timeout] ArithmeticOperator
src/components/Rating/Rating.tsx:54:19
               <div key={url} className="line">
                 <Button text="info" type="eco" onClick={() => getInfo(url)} />
                 <div role="RatingRaw" className="rating-raw">{`${
-                  i + 1
+                  i - 1
                 } ${name}`}</div>
               </div>

[Timeout] LogicalOperator
src/components/Rating/Rating.tsx:63:15
       </div>
 
       <div className="rating-block" role="block-info">
-        <div>{errorInfo && <div>{JSON.stringify(errorInfo)}</div>}</div>
+        <div>{errorInfo || <div>{JSON.stringify(errorInfo)}</div>}</div>
         <div className="info">
           {loadingInfo ? (

[Timeout] ConditionalExpression
src/components/Rating/Rating.tsx:63:15
       </div>
 
       <div className="rating-block" role="block-info">
-        <div>{errorInfo && <div>{JSON.stringify(errorInfo)}</div>}</div>
+        <div>{false}</div>
         <div className="info">
           {loadingInfo ? (

[Timeout] StringLiteral
src/components/Rating/Rating.tsx:69:21
             <div>LOADING...</div>
           ) : (
             <>
-              <div>{`name: ${info.name}`}</div>
+              <div>{``}</div>
               <div>{`weight: ${info.height}`}</div>
               <div>{`height: ${info.height}`}</div>
