[Timeout] StringLiteral
src/components/Score/Score.tsx:5:17
 import deepEqual from 'fast-deep-equal';
 import './Score.css';
 
-const GET_URL = 'http://localhost:3999/users';
+const GET_URL = "";
 const UPDATE_URL = 'http://localhost:3999/update';
 

[Timeout] StringLiteral
src/components/Score/Score.tsx:6:20
 import './Score.css';
 
 const GET_URL = 'http://localhost:3999/users';
-const UPDATE_URL = 'http://localhost:3999/update';
+const UPDATE_URL = "";
 
 type Props = {

[Timeout] LogicalOperator
src/components/Score/Score.tsx:29:21
   constructor(props: Props) {
     super(props);
     this.state = {
-      leftUserName: props.leftUserName || 'user A',
+      leftUserName: props.leftUserName && 'user A',
       leftPoint: props.leftPoint || 0,
       rightUserName: props.rightUserName || 'name B',

[Timeout] LogicalOperator
src/components/Score/Score.tsx:30:18
     super(props);
     this.state = {
       leftUserName: props.leftUserName || 'user A',
-      leftPoint: props.leftPoint || 0,
+      leftPoint: props.leftPoint && 0,
       rightUserName: props.rightUserName || 'name B',
       rightPoint: props.rightPoint || 0,

[Timeout] LogicalOperator
src/components/Score/Score.tsx:31:22
     this.state = {
       leftUserName: props.leftUserName || 'user A',
       leftPoint: props.leftPoint || 0,
-      rightUserName: props.rightUserName || 'name B',
+      rightUserName: props.rightUserName && 'name B',
       rightPoint: props.rightPoint || 0,
       separator: props.separator || ':',

[Timeout] StringLiteral
src/components/Score/Score.tsx:31:45
     this.state = {
       leftUserName: props.leftUserName || 'user A',
       leftPoint: props.leftPoint || 0,
-      rightUserName: props.rightUserName || 'name B',
+      rightUserName: props.rightUserName || "",
       rightPoint: props.rightPoint || 0,
       separator: props.separator || ':',

[Timeout] LogicalOperator
src/components/Score/Score.tsx:32:19
       leftUserName: props.leftUserName || 'user A',
       leftPoint: props.leftPoint || 0,
       rightUserName: props.rightUserName || 'name B',
-      rightPoint: props.rightPoint || 0,
+      rightPoint: props.rightPoint && 0,
       separator: props.separator || ':',
     };

[Timeout] LogicalOperator
src/components/Score/Score.tsx:33:18
       leftPoint: props.leftPoint || 0,
       rightUserName: props.rightUserName || 'name B',
       rightPoint: props.rightPoint || 0,
-      separator: props.separator || ':',
+      separator: props.separator && ':',
     };
     this.controller = null;

[Timeout] BlockStatement
src/components/Score/Score.tsx:41:34
   }
 
   // Event from Floor.tsx component
-  subscribe(eventName, listener) {
-    document.addEventListener(eventName, listener);
-  }
+  subscribe(eventName, listener) {}
 
   unsubscribe = (eventName, listener) => {

[Timeout] BlockStatement
src/components/Score/Score.tsx:45:42
     document.addEventListener(eventName, listener);
   }
 
-  unsubscribe = (eventName, listener) => {
-    document.removeEventListener(eventName, listener);
-  };
+  unsubscribe = (eventName, listener) => {};
 
   shouldComponentUpdate(

[Timeout] ConditionalExpression
src/components/Score/Score.tsx:53:9
     nextProps: Readonly<Props>,
     nextState: Readonly<State>,
   ): boolean {
-    if (deepEqual(nextState, this.state)) return false;
+    if (false) return false;
 
     console.log('Score was update');

[Timeout] ConditionalExpression
src/components/Score/Score.tsx:53:9
     nextProps: Readonly<Props>,
     nextState: Readonly<State>,
   ): boolean {
-    if (deepEqual(nextState, this.state)) return false;
+    if (true) return false;
 
     console.log('Score was update');

[Timeout] StringLiteral
src/components/Score/Score.tsx:55:17
   ): boolean {
     if (deepEqual(nextState, this.state)) return false;
 
-    console.log('Score was update');
+    console.log("");
     return true;
   }

[Timeout] BooleanLiteral
src/components/Score/Score.tsx:56:12
     if (deepEqual(nextState, this.state)) return false;
 
     console.log('Score was update');
-    return true;
+    return false;
   }
 

[Timeout] BlockStatement
src/components/Score/Score.tsx:59:78
     return true;
   }
 
-  componentDidUpdate(prevProps: Readonly<Props>, prevState: Readonly<State>) {
-    if (!deepEqual(prevState, this.state)) {
-      console.log('componentDidUpdate() with update');
-      // Как бы обновляем данные на сервере (вызываем просто get-метод-заглушку)
-      fetch(UPDATE_URL)
-        .then((response) => response.json())
-        .then(() => {
-          console.log('Condition was updated');
-        })
-        .catch((e) => console.error('Back error: ', e));
-    }
-  }
+  componentDidUpdate(prevProps: Readonly<Props>, prevState: Readonly<State>) {}
 
   componentDidMount() {

[Timeout] BlockStatement
src/components/Score/Score.tsx:60:44
   }
 
   componentDidUpdate(prevProps: Readonly<Props>, prevState: Readonly<State>) {
-    if (!deepEqual(prevState, this.state)) {
-      console.log('componentDidUpdate() with update');
-      // Как бы обновляем данные на сервере (вызываем просто get-метод-заглушку)
-      fetch(UPDATE_URL)
-        .then((response) => response.json())
-        .then(() => {
-          console.log('Condition was updated');
-        })
-        .catch((e) => console.error('Back error: ', e));
-    }
+    if (!deepEqual(prevState, this.state)) {}
   }
 

[Timeout] ConditionalExpression
src/components/Score/Score.tsx:60:9
   }
 
   componentDidUpdate(prevProps: Readonly<Props>, prevState: Readonly<State>) {
-    if (!deepEqual(prevState, this.state)) {
+    if (true) {
       console.log('componentDidUpdate() with update');
       // Как бы обновляем данные на сервере (вызываем просто get-метод-заглушку)

[Timeout] ArrowFunction
src/components/Score/Score.tsx:64:15
       console.log('componentDidUpdate() with update');
       // Как бы обновляем данные на сервере (вызываем просто get-метод-заглушку)
       fetch(UPDATE_URL)
-        .then((response) => response.json())
+        .then(() => undefined)
         .then(() => {
           console.log('Condition was updated');

[Timeout] BlockStatement
src/components/Score/Score.tsx:65:21
       // Как бы обновляем данные на сервере (вызываем просто get-метод-заглушку)
       fetch(UPDATE_URL)
         .then((response) => response.json())
-        .then(() => {
-          console.log('Condition was updated');
-        })
+        .then(() => {})
         .catch((e) => console.error('Back error: ', e));
     }

[Timeout] ArrowFunction
src/components/Score/Score.tsx:68:16
         .then(() => {
           console.log('Condition was updated');
         })
-        .catch((e) => console.error('Back error: ', e));
+        .catch(() => undefined);
     }
   }

[Timeout] StringLiteral
src/components/Score/Score.tsx:68:37
         .then(() => {
           console.log('Condition was updated');
         })
-        .catch((e) => console.error('Back error: ', e));
+        .catch((e) => console.error("", e));
     }
   }

[Timeout] BlockStatement
src/components/Score/Score.tsx:73:74
   }
 
   componentDidMount() {
-    this.subscribe('myEvent', (data: { detail: { isLeft: boolean } }) => {
-      console.log('myEvent got -->');
-
-      this.setState({
-        ...this.state,
-        leftPoint: data.detail.isLeft
-          ? this.state.leftPoint + 1
-          : this.state.leftPoint,
-        rightPoint: data.detail.isLeft
-          ? this.state.rightPoint
-          : this.state.rightPoint + 1,
-      });
-    });
+    this.subscribe('myEvent', (data: { detail: { isLeft: boolean } }) => {});
 
     this.controller = new AbortController();

[Timeout] ArithmeticOperator
src/components/Score/Score.tsx:79:13
       this.setState({
         ...this.state,
         leftPoint: data.detail.isLeft
-          ? this.state.leftPoint + 1
+          ? this.state.leftPoint - 1
           : this.state.leftPoint,
         rightPoint: data.detail.isLeft

[Timeout] ArithmeticOperator
src/components/Score/Score.tsx:83:13
           : this.state.leftPoint,
         rightPoint: data.detail.isLeft
           ? this.state.rightPoint
-          : this.state.rightPoint + 1,
+          : this.state.rightPoint - 1,
       });
     });

[Timeout] StringLiteral
src/components/Score/Score.tsx:88:17
     });
 
     this.controller = new AbortController();
-    console.log('componentDidMount()');
+    console.log("");
     // Получение данных об игроках (в данном случае просто имена)
     fetch(GET_URL, { signal: this.controller.signal })

[Timeout] ObjectLiteral
src/components/Score/Score.tsx:90:20
     this.controller = new AbortController();
     console.log('componentDidMount()');
     // Получение данных об игроках (в данном случае просто имена)
-    fetch(GET_URL, { signal: this.controller.signal })
+    fetch(GET_URL, {})
       .then((response) => response.json())
       .then((data: { userA: string; userB: string }) => {

[Timeout] ArrowFunction
src/components/Score/Score.tsx:91:13
     console.log('componentDidMount()');
     // Получение данных об игроках (в данном случае просто имена)
     fetch(GET_URL, { signal: this.controller.signal })
-      .then((response) => response.json())
+      .then(() => undefined)
       .then((data: { userA: string; userB: string }) => {
         console.log('Data from backend: ', data);

[Timeout] BlockStatement
src/components/Score/Score.tsx:92:57
     // Получение данных об игроках (в данном случае просто имена)
     fetch(GET_URL, { signal: this.controller.signal })
       .then((response) => response.json())
-      .then((data: { userA: string; userB: string }) => {
-        console.log('Data from backend: ', data);
-        if (!this.controller.signal.aborted) {
-          this.setState({
-            leftUserName: data.userA,
-            leftPoint: 0,
-            rightPoint: 0,
-            rightUserName: data.userB,
-          });
-        }
-      })
+      .then((data: { userA: string; userB: string }) => {})
       .catch((e) => console.error('Back error: ', e));
   }

[Timeout] StringLiteral
src/components/Score/Score.tsx:93:21
     fetch(GET_URL, { signal: this.controller.signal })
       .then((response) => response.json())
       .then((data: { userA: string; userB: string }) => {
-        console.log('Data from backend: ', data);
+        console.log("", data);
         if (!this.controller.signal.aborted) {
           this.setState({

[Timeout] BooleanLiteral
src/components/Score/Score.tsx:94:13
       .then((response) => response.json())
       .then((data: { userA: string; userB: string }) => {
         console.log('Data from backend: ', data);
-        if (!this.controller.signal.aborted) {
+        if (this.controller.signal.aborted) {
           this.setState({
             leftUserName: data.userA,

[Timeout] ConditionalExpression
src/components/Score/Score.tsx:94:13
       .then((response) => response.json())
       .then((data: { userA: string; userB: string }) => {
         console.log('Data from backend: ', data);
-        if (!this.controller.signal.aborted) {
+        if (true) {
           this.setState({
             leftUserName: data.userA,

[Timeout] BlockStatement
src/components/Score/Score.tsx:106:26
       .catch((e) => console.error('Back error: ', e));
   }
 
-  componentWillUnmount() {
-    console.log('componentWillUnmount()');
-    this.unsubscribe('myEvent', () => {
-      console.log('unsubscribe for "myEvent"');
-    });
-    this.controller.abort();
-  }
+  componentWillUnmount() {}
 
   doClearPoints = () => {

[Timeout] BlockStatement
src/components/Score/Score.tsx:108:39
 
   componentWillUnmount() {
     console.log('componentWillUnmount()');
-    this.unsubscribe('myEvent', () => {
-      console.log('unsubscribe for "myEvent"');
-    });
+    this.unsubscribe('myEvent', () => {});
     this.controller.abort();
   }

[Timeout] BlockStatement
src/components/Score/Score.tsx:114:25
     this.controller.abort();
   }
 
-  doClearPoints = () => {
-    console.log('doClearPoints()');
-    this.setState((prevState) => {
-      return {
-        ...prevState,
-        leftPoint: 0,
-        rightPoint: 0,
-      };
-    });
-  };
+  doClearPoints = () => {};
 
   render() {

[Timeout] BlockStatement
src/components/Score/Score.tsx:116:34
 
   doClearPoints = () => {
     console.log('doClearPoints()');
-    this.setState((prevState) => {
-      return {
-        ...prevState,
-        leftPoint: 0,
-        rightPoint: 0,
-      };
-    });
+    this.setState((prevState) => {});
   };
 

[Timeout] MethodExpression
src/components/Score/Score.tsx:129:17
     return (
       <div className="score" role="score">
         <div className="left" role="left">
-          <div>{this.state.leftUserName.toUpperCase()}</div>
+          <div>{this.state.leftUserName.toLowerCase()}</div>
           <p className="point" role="leftPoint">
             {this.state.leftPoint}

[Timeout] MethodExpression
src/components/Score/Score.tsx:141:15
           <p className="point" role="rightPoint">
             {this.state.rightPoint}
           </p>
-          <p>{this.state.rightUserName.toUpperCase()}</p>
+          <p>{this.state.rightUserName.toLowerCase()}</p>
         </div>
         <button className="cButton" onClick={this.doClearPoints}>
