[Timeout] BooleanLiteral
src/components/Floor/Floor.tsx:24:36
 };
 const TEST_ARRAY = [0, 1, 2, 3, 4, 5, 4, 3, 2];
 
-export const Floor = ({ testMode = true }) => {
+export const Floor = ({ testMode = false }) => {
   const [isLeft, setIsLeft] = useState(true);
   const [exit, setExit] = useState(false);

[Timeout] BooleanLiteral
src/components/Floor/Floor.tsx:25:40
 const TEST_ARRAY = [0, 1, 2, 3, 4, 5, 4, 3, 2];
 
 export const Floor = ({ testMode = true }) => {
-  const [isLeft, setIsLeft] = useState(true);
+  const [isLeft, setIsLeft] = useState(false);
   const [exit, setExit] = useState(false);
   const [startData, setStartData] = useState({

[Timeout] BooleanLiteral
src/components/Floor/Floor.tsx:26:36
 
 export const Floor = ({ testMode = true }) => {
   const [isLeft, setIsLeft] = useState(true);
-  const [exit, setExit] = useState(false);
+  const [exit, setExit] = useState(true);
   const [startData, setStartData] = useState({
     ...START_DATA_DEFAULT,

[Timeout] BlockStatement
src/components/Floor/Floor.tsx:35:61
   const [searchParams] = useSearchParams();
 
   // Publish to Score.tsx
-  const publish = (eventName, data: { isLeft: boolean }) => {
-    const event = new CustomEvent(eventName, { detail: data });
-    document.dispatchEvent(event);
-  };
+  const publish = (eventName, data: { isLeft: boolean }) => {};
 
   /**

[Timeout] ConditionalExpression
src/components/Floor/Floor.tsx:44:10
    * Ход игрока - обновление поля
    * */
   const updateArr = (position: 'left' | 'right') => {
-    if ((position === 'left' && !isLeft) || (position === 'right' && isLeft)) {
+    if ((false) || (position === 'right' && isLeft)) {
       alert(`Not your move`);
       console.error('Not your move');

[Timeout] ConditionalExpression
src/components/Floor/Floor.tsx:44:9
    * Ход игрока - обновление поля
    * */
   const updateArr = (position: 'left' | 'right') => {
-    if ((position === 'left' && !isLeft) || (position === 'right' && isLeft)) {
+    if (true) {
       alert(`Not your move`);
       console.error('Not your move');

[Timeout] StringLiteral
src/components/Floor/Floor.tsx:45:13
    * */
   const updateArr = (position: 'left' | 'right') => {
     if ((position === 'left' && !isLeft) || (position === 'right' && isLeft)) {
-      alert(`Not your move`);
+      alert(``);
       console.error('Not your move');
       return arr;

[Timeout] ConditionalExpression
src/components/Floor/Floor.tsx:51:21
     }
 
     const result = [];
-    for (let i = 0; i < arr.length; i++) {
+    for (let i = 0; false; i++) {
       const elm = arr[i];
       result.push(elm + Math.floor(Math.random() * 2));

[Timeout] EqualityOperator
src/components/Floor/Floor.tsx:51:21
     }
 
     const result = [];
-    for (let i = 0; i < arr.length; i++) {
+    for (let i = 0; i <= arr.length; i++) {
       const elm = arr[i];
       result.push(elm + Math.floor(Math.random() * 2));

[Timeout] ArithmeticOperator
src/components/Floor/Floor.tsx:53:19
     const result = [];
     for (let i = 0; i < arr.length; i++) {
       const elm = arr[i];
-      result.push(elm + Math.floor(Math.random() * 2));
+      result.push(elm - Math.floor(Math.random() * 2));
     }
 

[Timeout] ArithmeticOperator
src/components/Floor/Floor.tsx:53:36
     const result = [];
     for (let i = 0; i < arr.length; i++) {
       const elm = arr[i];
-      result.push(elm + Math.floor(Math.random() * 2));
+      result.push(elm + Math.floor(Math.random() / 2));
     }
 

[Timeout] BlockStatement
src/components/Floor/Floor.tsx:56:22
       result.push(elm + Math.floor(Math.random() * 2));
     }
 
-    setTimeout(() => {
-      if (result.find((elm) => elm >= 5)) {
-        publish('myEvent', { isLeft });
-        alert(
-          `Player ${
-            isLeft ? searchParams.get('player1') : searchParams.get('player2')
-          } win!`,
-        );
-      }
-    }, 100);
+    setTimeout(() => {}, 100);
 
     setIsLeft(!isLeft);

[Timeout] ArrowFunction
src/components/Floor/Floor.tsx:57:23
     }
 
     setTimeout(() => {
-      if (result.find((elm) => elm >= 5)) {
+      if (result.find(() => undefined)) {
         publish('myEvent', { isLeft });
         alert(

[Timeout] EqualityOperator
src/components/Floor/Floor.tsx:57:32
     }
 
     setTimeout(() => {
-      if (result.find((elm) => elm >= 5)) {
+      if (result.find((elm) => elm > 5)) {
         publish('myEvent', { isLeft });
         alert(

[Timeout] StringLiteral
src/components/Floor/Floor.tsx:61:69
         publish('myEvent', { isLeft });
         alert(
           `Player ${
-            isLeft ? searchParams.get('player1') : searchParams.get('player2')
+            isLeft ? searchParams.get('player1') : searchParams.get("")
           } win!`,
         );

[Timeout] BooleanLiteral
src/components/Floor/Floor.tsx:67:15
       }
     }, 100);
 
-    setIsLeft(!isLeft);
+    setIsLeft(isLeft);
     return result;
   };

[Timeout] BlockStatement
src/components/Floor/Floor.tsx:74:23
   /**
    * Перезагрузить поле для тех же игроков
    * */
-  const clean = () => {
-    const elements = startData.size.split('x').map((elm) => +elm);
-    const newArray = getRandomArray(
-      elements[0] * elements[1],
-      +startData.fillings,
-      +startData.maxStartPoints,
-    );
-
-    console.log('lo_ol_line_80--> newArray: ', newArray);
-    setArr(newArray);
-    setIsLeft(true);
-  };
+  const clean = () => {};
 
   /**

[Timeout] UnaryOperator
src/components/Floor/Floor.tsx:75:61
    * Перезагрузить поле для тех же игроков
    * */
   const clean = () => {
-    const elements = startData.size.split('x').map((elm) => +elm);
+    const elements = startData.size.split('x').map((elm) => -elm);
     const newArray = getRandomArray(
       elements[0] * elements[1],

[Timeout] ArrowFunction
src/components/Floor/Floor.tsx:75:52
    * Перезагрузить поле для тех же игроков
    * */
   const clean = () => {
-    const elements = startData.size.split('x').map((elm) => +elm);
+    const elements = startData.size.split('x').map(() => undefined);
     const newArray = getRandomArray(
       elements[0] * elements[1],

[Timeout] ArithmeticOperator
src/components/Floor/Floor.tsx:77:7
   const clean = () => {
     const elements = startData.size.split('x').map((elm) => +elm);
     const newArray = getRandomArray(
-      elements[0] * elements[1],
+      elements[0] / elements[1],
       +startData.fillings,
       +startData.maxStartPoints,

[Timeout] UnaryOperator
src/components/Floor/Floor.tsx:78:7
     const elements = startData.size.split('x').map((elm) => +elm);
     const newArray = getRandomArray(
       elements[0] * elements[1],
-      +startData.fillings,
+      -startData.fillings,
       +startData.maxStartPoints,
     );

[Timeout] UnaryOperator
src/components/Floor/Floor.tsx:79:7
     const newArray = getRandomArray(
       elements[0] * elements[1],
       +startData.fillings,
-      +startData.maxStartPoints,
+      -startData.maxStartPoints,
     );
 

[Timeout] StringLiteral
src/components/Floor/Floor.tsx:82:17
       +startData.maxStartPoints,
     );
 
-    console.log('lo_ol_line_80--> newArray: ', newArray);
+    console.log("", newArray);
     setArr(newArray);
     setIsLeft(true);

[Timeout] BooleanLiteral
src/components/Floor/Floor.tsx:84:15
 
     console.log('lo_ol_line_80--> newArray: ', newArray);
     setArr(newArray);
-    setIsLeft(true);
+    setIsLeft(false);
   };
 

[Timeout] BooleanLiteral
src/components/Floor/Floor.tsx:90:32
   /**
    * Выход из игры
    * */
-  const toExit = () => setExit(true);
+  const toExit = () => setExit(false);
 
   return (

[Timeout] ArrowFunction
src/components/Floor/Floor.tsx:90:18
   /**
    * Выход из игры
    * */
-  const toExit = () => setExit(true);
+  const toExit = () => undefined;
 
   return (

[Timeout] ConditionalExpression
src/components/Floor/Floor.tsx:104:25
 
       <StyledCenteredDiv>
         <div className="playerButton">
-          <StyledLabel>{isLeft && 'Your move'}</StyledLabel>
+          <StyledLabel>{false}</StyledLabel>
           <Button
             text={searchParams.get('player1')}

[Timeout] ConditionalExpression
src/components/Floor/Floor.tsx:104:25
 
       <StyledCenteredDiv>
         <div className="playerButton">
-          <StyledLabel>{isLeft && 'Your move'}</StyledLabel>
+          <StyledLabel>{true}</StyledLabel>
           <Button
             text={searchParams.get('player1')}

[Timeout] ArrowFunction
src/components/Floor/Floor.tsx:108:22
           <Button
             text={searchParams.get('player1')}
             type="eco"
-            onClick={() => setArr(updateArr('left'))}
+            onClick={() => undefined}
           ></Button>
         </div>

[Timeout] ArrowFunction
src/components/Floor/Floor.tsx:112:20
           ></Button>
         </div>
         <StyledFloorDiv size={startData.size}>
-          {arr.map((elm, i) => (
-            <Box key={i} point={arr[i]} order={i} />
-          ))}
+          {arr.map(() => undefined)}
         </StyledFloorDiv>
         <div className="playerButton">

[Timeout] ConditionalExpression
src/components/Floor/Floor.tsx:117:25
           ))}
         </StyledFloorDiv>
         <div className="playerButton">
-          <StyledLabel>{!isLeft && 'Your move'}</StyledLabel>
+          <StyledLabel>{false}</StyledLabel>
           <Button
             text={searchParams.get('player2')}

[Timeout] ConditionalExpression
src/components/Floor/Floor.tsx:117:25
           ))}
         </StyledFloorDiv>
         <div className="playerButton">
-          <StyledLabel>{!isLeft && 'Your move'}</StyledLabel>
+          <StyledLabel>{true}</StyledLabel>
           <Button
             text={searchParams.get('player2')}

[Timeout] ArrowFunction
src/components/Floor/Floor.tsx:121:22
           <Button
             text={searchParams.get('player2')}
             type="eco"
-            onClick={() => setArr(updateArr('right'))}
+            onClick={() => undefined}
           ></Button>
         </div>

[Timeout] ArrowFunction
src/components/Floor/Floor.tsx:127:52
       </StyledCenteredDiv>
 
       <div className="cleanButton" role="cleanButton">
-        <Button text="against" type="eco" onClick={() => clean()}></Button>
+        <Button text="against" type="eco" onClick={() => undefined}></Button>
         <Button text="exit" type="blue" onClick={() => toExit()}></Button>
       </div>

[Timeout] ArrowFunction
src/components/Floor/Floor.tsx:128:50
 
       <div className="cleanButton" role="cleanButton">
         <Button text="against" type="eco" onClick={() => clean()}></Button>
-        <Button text="exit" type="blue" onClick={() => toExit()}></Button>
+        <Button text="exit" type="blue" onClick={() => undefined}></Button>
       </div>
 

[Timeout] ConditionalExpression
src/components/Floor/Floor.tsx:131:13
         <Button text="exit" type="blue" onClick={() => toExit()}></Button>
       </div>
 
-      <div>{exit && <Navigate to="/" replace={true} />}</div>
+      <div>{true}</div>
     </div>
   );

[Timeout] ConditionalExpression
src/components/Floor/Floor.tsx:131:13
         <Button text="exit" type="blue" onClick={() => toExit()}></Button>
       </div>
 
-      <div>{exit && <Navigate to="/" replace={true} />}</div>
+      <div>{false}</div>
     </div>
   );
