[Timeout] StringLiteral
src/components/Button/Button.tsx:4:26
 import React from 'react';
 import './Button.css';
 
-const Button = ({ text = 'click', type = 'default', onClick }) => {
+const Button = ({ text = "", type = 'default', onClick }) => {
   return (
     <button type="button" className={type} onClick={onClick}>
