[Timeout] StringLiteral
src/components/Box/Box.stories.tsx:6:10
 import Box from './Box';
 
 export default {
-  title: 'Box',
+  title: "",
   component: Box,
   argTypes: {

[Timeout] ObjectLiteral
src/components/Box/Box.stories.tsx:8:13
 export default {
   title: 'Box',
   component: Box,
-  argTypes: {
-    point: {
-      type: 'number',
-      description: 'Количество очков',
-      defaultValue: 1,
-      options: [0, 1, 2, 3, 4, 5],
-      control: {
-        type: 'radio',
-      },
-    },
-  },
+  argTypes: {},
 };
 

[Timeout] StringLiteral
src/components/Box/Box.stories.tsx:11:20
   argTypes: {
     point: {
       type: 'number',
-      description: 'Количество очков',
+      description: "",
       defaultValue: 1,
       options: [0, 1, 2, 3, 4, 5],

[Timeout] ArrayDeclaration
src/components/Box/Box.stories.tsx:13:16
       type: 'number',
       description: 'Количество очков',
       defaultValue: 1,
-      options: [0, 1, 2, 3, 4, 5],
+      options: [],
       control: {
         type: 'radio',

[Timeout] ObjectLiteral
src/components/Box/Box.stories.tsx:24:16
 const Template = (arg) => <Box {...arg} />;
 
 export const Default = Template.bind({});
-Default.args = {
-  point: 0,
-};
+Default.args = {};
 
