[Timeout] ArrayDeclaration
src/lesson-2/helper/helper.ts:1:19
-const OPERATORS = ['+', '-', '*', '/'];
+const OPERATORS = [];
 
 // export const isMultiplierOrDivisorOp = (str: string): str is '*' | '/' => {

[Timeout] UnaryOperator
src/lesson-2/helper/helper.ts:12:17
 };
 
 export const isNumber = (value: string) => {
-  return !isNaN(+value);
+  return !isNaN(-value);
 };
 

[Timeout] BooleanLiteral
src/lesson-2/helper/helper.ts:12:10
 };
 
 export const isNumber = (value: string) => {
-  return !isNaN(+value);
+  return isNaN(+value);
 };
 

[Timeout] ConditionalExpression
src/lesson-2/helper/helper.ts:16:10
 };
 
 export const isEnd = (index: number, array: string[]) => {
-  return index === array.length - 2;
+  return false;
 };
 

[Timeout] EqualityOperator
src/lesson-2/helper/helper.ts:16:10
 };
 
 export const isEnd = (index: number, array: string[]) => {
-  return index === array.length - 2;
+  return index !== array.length - 2;
 };
 
