[Timeout] ArrayDeclaration
src/components/Button/Button.stories.tsx:17:16
     type: {
       type: 'string',
       description: 'Стиль/тип кнопки',
-      options: ['default', 'eco', 'blue'],
+      options: [],
       defaultValue: 'default',
       control: {

[Timeout] StringLiteral
src/components/Button/Button.stories.tsx:17:17
     type: {
       type: 'string',
       description: 'Стиль/тип кнопки',
-      options: ['default', 'eco', 'blue'],
+      options: ["", 'eco', 'blue'],
       defaultValue: 'default',
       control: {

[Timeout] StringLiteral
src/components/Button/Button.stories.tsx:18:21
       type: 'string',
       description: 'Стиль/тип кнопки',
       options: ['default', 'eco', 'blue'],
-      defaultValue: 'default',
+      defaultValue: "",
       control: {
         type: 'radio',

[Timeout] ObjectLiteral
src/components/Button/Button.stories.tsx:19:16
       description: 'Стиль/тип кнопки',
       options: ['default', 'eco', 'blue'],
       defaultValue: 'default',
-      control: {
-        type: 'radio',
-      },
+      control: {},
     },
   },
