[Timeout] StringLiteral
src/components/Container/Container.tsx:4:20
 import React, { useEffect, useState } from 'react';
 import Rating from '../Rating/Rating';
 
-const RATING_URL = 'http://localhost:3999/rating';
+const RATING_URL = "";
 
 const Container = () => {

[Timeout] BlockStatement
src/components/Container/Container.tsx:6:25
 
 const RATING_URL = 'http://localhost:3999/rating';
 
-const Container = () => {
-  const [list, setList] = useState([]);
-  useEffect(() => {
-    fetch(RATING_URL)
-      .then((response) => response.json())
-      .then(({ rating }) => {
-        console.log('Rating was gow: ', rating);
-        setList(rating);
-      })
-      .catch((e) => console.error('Back error: ', e));
-  }, []);
-
-  return (
-    <>
-      <Rating testMode={false}></Rating>
-    </>
-  );
-};
+const Container = () => {};
 
 export default Container;

[Timeout] ArrayDeclaration
src/components/Container/Container.tsx:7:36
 const RATING_URL = 'http://localhost:3999/rating';
 
 const Container = () => {
-  const [list, setList] = useState([]);
+  const [list, setList] = useState(["Stryker was here"]);
   useEffect(() => {
     fetch(RATING_URL)

[Timeout] BlockStatement
src/components/Container/Container.tsx:8:19
 
 const Container = () => {
   const [list, setList] = useState([]);
-  useEffect(() => {
-    fetch(RATING_URL)
-      .then((response) => response.json())
-      .then(({ rating }) => {
-        console.log('Rating was gow: ', rating);
-        setList(rating);
-      })
-      .catch((e) => console.error('Back error: ', e));
-  }, []);
+  useEffect(() => {}, []);
 
   return (

[Timeout] ArrowFunction
src/components/Container/Container.tsx:10:13
   const [list, setList] = useState([]);
   useEffect(() => {
     fetch(RATING_URL)
-      .then((response) => response.json())
+      .then(() => undefined)
       .then(({ rating }) => {
         console.log('Rating was gow: ', rating);

[Timeout] BlockStatement
src/components/Container/Container.tsx:11:29
   useEffect(() => {
     fetch(RATING_URL)
       .then((response) => response.json())
-      .then(({ rating }) => {
-        console.log('Rating was gow: ', rating);
-        setList(rating);
-      })
+      .then(({ rating }) => {})
       .catch((e) => console.error('Back error: ', e));
   }, []);

[Timeout] StringLiteral
src/components/Container/Container.tsx:12:21
     fetch(RATING_URL)
       .then((response) => response.json())
       .then(({ rating }) => {
-        console.log('Rating was gow: ', rating);
+        console.log("", rating);
         setList(rating);
       })

[Timeout] ArrayDeclaration
src/components/Container/Container.tsx:16:6
         setList(rating);
       })
       .catch((e) => console.error('Back error: ', e));
-  }, []);
+  }, ["Stryker was here"]);
 
   return (

[Timeout] BooleanLiteral
src/components/Container/Container.tsx:20:25
 
   return (
     <>
-      <Rating testMode={false}></Rating>
+      <Rating testMode={true}></Rating>
     </>
   );
