[Timeout] ObjectLiteral
src/components/Enter/Enter.stories.tsx:5:16
 
 import { Enter } from './Enter';
 
-export default {
-  title: 'Enter',
-  component: Enter,
-  argTypes: {},
-};
+export default {};
 
 const Template = (arg) => <Enter {...arg} />;

[Timeout] ArrowFunction
src/components/Enter/Enter.stories.tsx:11:18
   argTypes: {},
 };
 
-const Template = (arg) => <Enter {...arg} />;
+const Template = () => undefined;
 
 export const Default = Template.bind({});
