[Timeout] ArrayDeclaration
src/components/Floor/Floor.stories.tsx:8:15
 export default {
   title: 'Floor',
   component: Floor,
-  decorators: [withRouter],
+  decorators: [],
   parameters: {
     reactRouter: {

[Timeout] StringLiteral
src/components/Floor/Floor.stories.tsx:12:50
   parameters: {
     reactRouter: {
       routePath: '/game',
-      searchParams: { player1: 'Misha', player2: 'Sasha' },
+      searchParams: { player1: 'Misha', player2: "" },
     },
   },

[Timeout] ObjectLiteral
src/components/Floor/Floor.stories.tsx:12:21
   parameters: {
     reactRouter: {
       routePath: '/game',
-      searchParams: { player1: 'Misha', player2: 'Sasha' },
+      searchParams: {},
     },
   },

[Timeout] StringLiteral
src/components/Floor/Floor.stories.tsx:17:13
   },
   argTypes: {
     groundType: {
-      type: 'string',
+      type: "",
       description: 'Стиль/тип поля',
       options: ['yellow', 'sky'],

[Timeout] StringLiteral
src/components/Floor/Floor.stories.tsx:19:17
     groundType: {
       type: 'string',
       description: 'Стиль/тип поля',
-      options: ['yellow', 'sky'],
+      options: ["", 'sky'],
       defaultValue: 'yellow',
       control: {

[Timeout] ArrowFunction
src/components/Floor/Floor.stories.tsx:28:18
   },
 };
 
-const Template = (arg) => <Floor {...arg} />;
+const Template = () => undefined;
 
 export const Default = Template.bind({});
