[Timeout] ObjectLiteral
src/components/Form/Form.stories.tsx:5:16
 
 import Form from './Form';
 
-export default {
-  title: 'Form',
-  component: Form,
-  argTypes: {},
-};
+export default {};
 
 const Template = (arg) => <Form {...arg} />;

[Timeout] StringLiteral
src/components/Form/Form.stories.tsx:6:10
 import Form from './Form';
 
 export default {
-  title: 'Form',
+  title: "",
   component: Form,
   argTypes: {},

[Timeout] ArrowFunction
src/components/Form/Form.stories.tsx:11:18
   argTypes: {},
 };
 
-const Template = (arg) => <Form {...arg} />;
+const Template = () => undefined;
 
 export const Default = Template.bind({});
