[Timeout] ArrowFunction
src/components/Rating/Raring.stories.tsx:19:18
   ],
 };
 
-const Template = (arg) => <Rating {...arg} />;
+const Template = () => undefined;
 
 export const Default = Template.bind({});
