[Timeout] ArithmeticOperator
src/lesson-2/helper/math-method.ts:1:68
-export const plus: OperationFn = (a: number, b: number): number => a + b;
+export const plus: OperationFn = (a: number, b: number): number => a - b;
 
 export const minus: OperationFn = (a: number, b: number): number => a - b;

[Timeout] ArrowFunction
src/lesson-2/helper/math-method.ts:1:34
-export const plus: OperationFn = (a: number, b: number): number => a + b;
+export const plus: OperationFn = () => undefined;
 
 export const minus: OperationFn = (a: number, b: number): number => a - b;

[Timeout] ArrowFunction
src/lesson-2/helper/math-method.ts:3:35
 export const plus: OperationFn = (a: number, b: number): number => a + b;
 
-export const minus: OperationFn = (a: number, b: number): number => a - b;
+export const minus: OperationFn = () => undefined;
 
 export const division: OperationFn = (a: number, b: number): number => a / b;

[Timeout] ArithmeticOperator
src/lesson-2/helper/math-method.ts:3:69
 export const plus: OperationFn = (a: number, b: number): number => a + b;
 
-export const minus: OperationFn = (a: number, b: number): number => a - b;
+export const minus: OperationFn = (a: number, b: number): number => a + b;
 
 export const division: OperationFn = (a: number, b: number): number => a / b;

[Timeout] ArithmeticOperator
src/lesson-2/helper/math-method.ts:5:72
 
 export const minus: OperationFn = (a: number, b: number): number => a - b;
 
-export const division: OperationFn = (a: number, b: number): number => a / b;
+export const division: OperationFn = (a: number, b: number): number => a * b;
 
 export const multiplication: OperationFn = (a: number, b: number): number =>

[Timeout] ArrowFunction
src/lesson-2/helper/math-method.ts:5:38
 
 export const minus: OperationFn = (a: number, b: number): number => a - b;
 
-export const division: OperationFn = (a: number, b: number): number => a / b;
+export const division: OperationFn = () => undefined;
 
 export const multiplication: OperationFn = (a: number, b: number): number =>

[Timeout] ArrowFunction
src/lesson-2/helper/math-method.ts:7:44
 
 export const division: OperationFn = (a: number, b: number): number => a / b;
 
-export const multiplication: OperationFn = (a: number, b: number): number =>
-  a * b;
+export const multiplication: OperationFn = () => undefined;
 
 export type Operator = '+' | '-' | '*' | '/';

[Timeout] ArithmeticOperator
src/lesson-2/helper/math-method.ts:8:3
 export const division: OperationFn = (a: number, b: number): number => a / b;
 
 export const multiplication: OperationFn = (a: number, b: number): number =>
-  a * b;
+  a / b;
 
 export type Operator = '+' | '-' | '*' | '/';
