[Timeout] BooleanLiteral
src/lesson-2/index.ts:8:14
   input: process.stdin,
   output: process.stdout,
 });
-const TRUE = true;
+const TRUE = false;
 
 const request = () =>

[Timeout] ArrowFunction
src/lesson-2/index.ts:10:17
 });
 const TRUE = true;
 
-const request = () =>
-  new Promise((resolve) => {
-    readlineInterface.question('> ', (answer: string) => {
-      try {
-        calculation(answer);
-      } catch (e) {
-        if (e instanceof Error) {
-          console.error(e.message);
-        } else {
-          console.error(JSON.stringify(e));
-        }
-      }
-
-      resolve(null);
-    });
-  });
+const request = () => undefined;
 
 async function run() {

[Timeout] BlockStatement
src/lesson-2/index.ts:11:28
 const TRUE = true;
 
 const request = () =>
-  new Promise((resolve) => {
-    readlineInterface.question('> ', (answer: string) => {
-      try {
-        calculation(answer);
-      } catch (e) {
-        if (e instanceof Error) {
-          console.error(e.message);
-        } else {
-          console.error(JSON.stringify(e));
-        }
-      }
-
-      resolve(null);
-    });
-  });
+  new Promise((resolve) => {});
 
 async function run() {

[Timeout] BlockStatement
src/lesson-2/index.ts:12:58
 
 const request = () =>
   new Promise((resolve) => {
-    readlineInterface.question('> ', (answer: string) => {
-      try {
-        calculation(answer);
-      } catch (e) {
-        if (e instanceof Error) {
-          console.error(e.message);
-        } else {
-          console.error(JSON.stringify(e));
-        }
-      }
-
-      resolve(null);
-    });
+    readlineInterface.question('> ', (answer: string) => {});
   });
 

[Timeout] BlockStatement
src/lesson-2/index.ts:13:11
 const request = () =>
   new Promise((resolve) => {
     readlineInterface.question('> ', (answer: string) => {
-      try {
-        calculation(answer);
-      } catch (e) {
+      try {} catch (e) {
         if (e instanceof Error) {
           console.error(e.message);

[Timeout] BlockStatement
src/lesson-2/index.ts:15:19
     readlineInterface.question('> ', (answer: string) => {
       try {
         calculation(answer);
-      } catch (e) {
-        if (e instanceof Error) {
-          console.error(e.message);
-        } else {
-          console.error(JSON.stringify(e));
-        }
-      }
+      } catch (e) {}
 
       resolve(null);

[Timeout] ConditionalExpression
src/lesson-2/index.ts:16:13
       try {
         calculation(answer);
       } catch (e) {
-        if (e instanceof Error) {
+        if (true) {
           console.error(e.message);
         } else {

[Timeout] ConditionalExpression
src/lesson-2/index.ts:16:13
       try {
         calculation(answer);
       } catch (e) {
-        if (e instanceof Error) {
+        if (false) {
           console.error(e.message);
         } else {

[Timeout] BlockStatement
src/lesson-2/index.ts:18:16
       } catch (e) {
         if (e instanceof Error) {
           console.error(e.message);
-        } else {
-          console.error(JSON.stringify(e));
-        }
+        } else {}
       }
 

[Timeout] BlockStatement
src/lesson-2/index.ts:27:22
     });
   });
 
-async function run() {
-  while (TRUE) {
-    await request();
-  }
-}
+async function run() {}
 
 run().catch((e) => console.error(e.message));

[Timeout] ConditionalExpression
src/lesson-2/index.ts:28:10
   });
 
 async function run() {
-  while (TRUE) {
+  while (false) {
     await request();
   }

[Timeout] BlockStatement
src/lesson-2/index.ts:28:16
   });
 
 async function run() {
-  while (TRUE) {
-    await request();
-  }
+  while (TRUE) {}
 }
 

[Timeout] ArrowFunction
src/lesson-2/index.ts:33:13
   }
 }
 
-run().catch((e) => console.error(e.message));
+run().catch(() => undefined);
 
