[Timeout] StringLiteral
src/store/thunk/rating-think.ts:7:11
 
 const testList = [
   { name: 'name_1' },
-  { name: 'name_2' },
+  { name: "" },
   { name: 'name_3' },
   { name: 'name_4' },

[Timeout] ObjectLiteral
src/store/thunk/rating-think.ts:7:3
 
 const testList = [
   { name: 'name_1' },
-  { name: 'name_2' },
+  {},
   { name: 'name_3' },
   { name: 'name_4' },

[Timeout] ObjectLiteral
src/store/thunk/rating-think.ts:8:3
 const testList = [
   { name: 'name_1' },
   { name: 'name_2' },
-  { name: 'name_3' },
+  {},
   { name: 'name_4' },
   { name: 'name_5' },

[Timeout] ObjectLiteral
src/store/thunk/rating-think.ts:9:3
   { name: 'name_1' },
   { name: 'name_2' },
   { name: 'name_3' },
-  { name: 'name_4' },
+  {},
   { name: 'name_5' },
   { name: 'name_6' },

[Timeout] StringLiteral
src/store/thunk/rating-think.ts:10:11
   { name: 'name_2' },
   { name: 'name_3' },
   { name: 'name_4' },
-  { name: 'name_5' },
+  { name: "" },
   { name: 'name_6' },
   { name: 'name_7' },

[Timeout] ObjectLiteral
src/store/thunk/rating-think.ts:10:3
   { name: 'name_2' },
   { name: 'name_3' },
   { name: 'name_4' },
-  { name: 'name_5' },
+  {},
   { name: 'name_6' },
   { name: 'name_7' },

[Timeout] StringLiteral
src/store/thunk/rating-think.ts:11:11
   { name: 'name_3' },
   { name: 'name_4' },
   { name: 'name_5' },
-  { name: 'name_6' },
+  { name: "" },
   { name: 'name_7' },
   { name: 'name_8' },

[Timeout] StringLiteral
src/store/thunk/rating-think.ts:13:11
   { name: 'name_5' },
   { name: 'name_6' },
   { name: 'name_7' },
-  { name: 'name_8' },
+  { name: "" },
   { name: 'name_9' },
   { name: 'name_10' },

[Timeout] BooleanLiteral
src/store/thunk/rating-think.ts:19:15
 ];
 
 export const getRatingThunk =
-  (testMode = false) =>
+  (testMode = true) =>
   async (dispatch): Promise<void> => {
     dispatch({ type: 'LOADING_LIST', payload: 'loading' });

[Timeout] BlockStatement
src/store/thunk/rating-think.ts:20:38
 
 export const getRatingThunk =
   (testMode = false) =>
-  async (dispatch): Promise<void> => {
-    dispatch({ type: 'LOADING_LIST', payload: 'loading' });
-
-    if (testMode) {
-      dispatch({
-        type: 'GET_LIST',
-        payload: testList,
-      });
-      return;
-    }
-
-    try {
-      const { data } = await axios.get(RATING_URL, {
-        headers: { 'Content-Type': 'application/json' },
-      });
-      const random = Math.floor(Math.random() * 39);
-      dispatch({
-        type: 'GET_LIST',
-        payload: data.results.slice(random, random + 10),
-      });
-    } catch (error) {
-      console.error('Error getRatingThunk():', error);
-      dispatch({ type: 'LIST_ERROR', payload: error });
-    }
-  };
+  async (dispatch): Promise<void> => {};
 
 export const getInfoThunk =

[Timeout] ConditionalExpression
src/store/thunk/rating-think.ts:23:9
   async (dispatch): Promise<void> => {
     dispatch({ type: 'LOADING_LIST', payload: 'loading' });
 
-    if (testMode) {
+    if (true) {
       dispatch({
         type: 'GET_LIST',

[Timeout] BlockStatement
src/store/thunk/rating-think.ts:23:19
   async (dispatch): Promise<void> => {
     dispatch({ type: 'LOADING_LIST', payload: 'loading' });
 
-    if (testMode) {
-      dispatch({
-        type: 'GET_LIST',
-        payload: testList,
-      });
-      return;
-    }
+    if (testMode) {}
 
     try {

[Timeout] BlockStatement
src/store/thunk/rating-think.ts:31:9
       return;
     }
 
-    try {
-      const { data } = await axios.get(RATING_URL, {
-        headers: { 'Content-Type': 'application/json' },
-      });
-      const random = Math.floor(Math.random() * 39);
-      dispatch({
-        type: 'GET_LIST',
-        payload: data.results.slice(random, random + 10),
-      });
-    } catch (error) {
+    try {} catch (error) {
       console.error('Error getRatingThunk():', error);
       dispatch({ type: 'LIST_ERROR', payload: error });

[Timeout] ArithmeticOperator
src/store/thunk/rating-think.ts:35:33
       const { data } = await axios.get(RATING_URL, {
         headers: { 'Content-Type': 'application/json' },
       });
-      const random = Math.floor(Math.random() * 39);
+      const random = Math.floor(Math.random() / 39);
       dispatch({
         type: 'GET_LIST',

[Timeout] ObjectLiteral
src/store/thunk/rating-think.ts:36:16
         headers: { 'Content-Type': 'application/json' },
       });
       const random = Math.floor(Math.random() * 39);
-      dispatch({
-        type: 'GET_LIST',
-        payload: data.results.slice(random, random + 10),
-      });
+      dispatch({});
     } catch (error) {
       console.error('Error getRatingThunk():', error);

[Timeout] MethodExpression
src/store/thunk/rating-think.ts:38:18
       const random = Math.floor(Math.random() * 39);
       dispatch({
         type: 'GET_LIST',
-        payload: data.results.slice(random, random + 10),
+        payload: data.results,
       });
     } catch (error) {

[Timeout] ArithmeticOperator
src/store/thunk/rating-think.ts:38:45
       const random = Math.floor(Math.random() * 39);
       dispatch({
         type: 'GET_LIST',
-        payload: data.results.slice(random, random + 10),
+        payload: data.results.slice(random, random - 10),
       });
     } catch (error) {

[Timeout] BlockStatement
src/store/thunk/rating-think.ts:40:21
         type: 'GET_LIST',
         payload: data.results.slice(random, random + 10),
       });
-    } catch (error) {
-      console.error('Error getRatingThunk():', error);
-      dispatch({ type: 'LIST_ERROR', payload: error });
-    }
+    } catch (error) {}
   };
 

[Timeout] StringLiteral
src/store/thunk/rating-think.ts:41:21
         payload: data.results.slice(random, random + 10),
       });
     } catch (error) {
-      console.error('Error getRatingThunk():', error);
+      console.error("", error);
       dispatch({ type: 'LIST_ERROR', payload: error });
     }

[Timeout] StringLiteral
src/store/thunk/rating-think.ts:42:24
       });
     } catch (error) {
       console.error('Error getRatingThunk():', error);
-      dispatch({ type: 'LIST_ERROR', payload: error });
+      dispatch({ type: "", payload: error });
     }
   };

[Timeout] BlockStatement
src/store/thunk/rating-think.ts:48:38
 
 export const getInfoThunk =
   (url) =>
-  async (dispatch): Promise<void> => {
-    dispatch({ type: 'LOADING_INFO', payload: 'loading' });
-    let payload = null;
-
-    try {
-      const storageData = localStorage.getItem(url);
-      if (storageData) {
-        payload = JSON.parse(storageData);
-      } else {
-        const { data } = await axios.get(url || TEST_URL, {
-          headers: { 'Content-Type': 'application/json' },
-        });
-        const { name, weight, height, abilities } = data;
-        const abilityArray = abilities.map(({ ability }) => ability.name);
-
-        payload = { name, weight, height, abilities: abilityArray };
-        localStorage.setItem(url, JSON.stringify(payload));
-      }
-
-      dispatch({ type: 'GET_INFO', payload });
-    } catch (error) {
-      console.error('Error getInfoThunk():', error);
-      dispatch({ type: 'INFO_ERROR', payload: error });
-    }
-  };
+  async (dispatch): Promise<void> => {};
 

[Timeout] StringLiteral
src/store/thunk/rating-think.ts:49:47
 export const getInfoThunk =
   (url) =>
   async (dispatch): Promise<void> => {
-    dispatch({ type: 'LOADING_INFO', payload: 'loading' });
+    dispatch({ type: 'LOADING_INFO', payload: "" });
     let payload = null;
 

[Timeout] StringLiteral
src/store/thunk/rating-think.ts:49:22
 export const getInfoThunk =
   (url) =>
   async (dispatch): Promise<void> => {
-    dispatch({ type: 'LOADING_INFO', payload: 'loading' });
+    dispatch({ type: "", payload: 'loading' });
     let payload = null;
 

[Timeout] BlockStatement
src/store/thunk/rating-think.ts:52:9
     dispatch({ type: 'LOADING_INFO', payload: 'loading' });
     let payload = null;
 
-    try {
-      const storageData = localStorage.getItem(url);
-      if (storageData) {
-        payload = JSON.parse(storageData);
-      } else {
-        const { data } = await axios.get(url || TEST_URL, {
-          headers: { 'Content-Type': 'application/json' },
-        });
-        const { name, weight, height, abilities } = data;
-        const abilityArray = abilities.map(({ ability }) => ability.name);
-
-        payload = { name, weight, height, abilities: abilityArray };
-        localStorage.setItem(url, JSON.stringify(payload));
-      }
-
-      dispatch({ type: 'GET_INFO', payload });
-    } catch (error) {
+    try {} catch (error) {
       console.error('Error getInfoThunk():', error);
       dispatch({ type: 'INFO_ERROR', payload: error });

[Timeout] ConditionalExpression
src/store/thunk/rating-think.ts:54:11
 
     try {
       const storageData = localStorage.getItem(url);
-      if (storageData) {
+      if (false) {
         payload = JSON.parse(storageData);
       } else {

[Timeout] ConditionalExpression
src/store/thunk/rating-think.ts:54:11
 
     try {
       const storageData = localStorage.getItem(url);
-      if (storageData) {
+      if (true) {
         payload = JSON.parse(storageData);
       } else {

[Timeout] BlockStatement
src/store/thunk/rating-think.ts:56:14
       const storageData = localStorage.getItem(url);
       if (storageData) {
         payload = JSON.parse(storageData);
-      } else {
-        const { data } = await axios.get(url || TEST_URL, {
-          headers: { 'Content-Type': 'application/json' },
-        });
-        const { name, weight, height, abilities } = data;
-        const abilityArray = abilities.map(({ ability }) => ability.name);
-
-        payload = { name, weight, height, abilities: abilityArray };
-        localStorage.setItem(url, JSON.stringify(payload));
-      }
+      } else {}
 
       dispatch({ type: 'GET_INFO', payload });

[Timeout] LogicalOperator
src/store/thunk/rating-think.ts:57:42
       if (storageData) {
         payload = JSON.parse(storageData);
       } else {
-        const { data } = await axios.get(url || TEST_URL, {
+        const { data } = await axios.get(url && TEST_URL, {
           headers: { 'Content-Type': 'application/json' },
         });

[Timeout] ObjectLiteral
src/store/thunk/rating-think.ts:58:20
         payload = JSON.parse(storageData);
       } else {
         const { data } = await axios.get(url || TEST_URL, {
-          headers: { 'Content-Type': 'application/json' },
+          headers: {},
         });
         const { name, weight, height, abilities } = data;

[Timeout] ArrowFunction
src/store/thunk/rating-think.ts:61:44
           headers: { 'Content-Type': 'application/json' },
         });
         const { name, weight, height, abilities } = data;
-        const abilityArray = abilities.map(({ ability }) => ability.name);
+        const abilityArray = abilities.map(() => undefined);
 
         payload = { name, weight, height, abilities: abilityArray };

[Timeout] StringLiteral
src/store/thunk/rating-think.ts:67:24
         localStorage.setItem(url, JSON.stringify(payload));
       }
 
-      dispatch({ type: 'GET_INFO', payload });
+      dispatch({ type: "", payload });
     } catch (error) {
       console.error('Error getInfoThunk():', error);

[Timeout] BlockStatement
src/store/thunk/rating-think.ts:68:21
       }
 
       dispatch({ type: 'GET_INFO', payload });
-    } catch (error) {
-      console.error('Error getInfoThunk():', error);
-      dispatch({ type: 'INFO_ERROR', payload: error });
-    }
+    } catch (error) {}
   };
 
