[Timeout] ObjectLiteral
src/components/Score/Score.stories.tsx:8:13
 export default {
   title: 'Score',
   component: Score,
-  argTypes: {
-    leftUserName: {
-      type: 'string',
-      description: 'Имя пользователя слева',
-      defaultValue: 'User A',
-    },
-    rightUserName: {
-      type: 'string',
-      description: 'Имя пользователя справа',
-      defaultValue: 'User B',
-    },
-    leftPoint: {
-      type: 'number',
-      description: 'Очки пользователя слева',
-      defaultValue: 0,
-    },
-    rightPoint: {
-      type: 'number',
-      description: 'Очки пользователя справа',
-      defaultValue: 0,
-    },
-  },
+  argTypes: {},
 };
 

[Timeout] ObjectLiteral
src/components/Score/Score.stories.tsx:9:19
   title: 'Score',
   component: Score,
   argTypes: {
-    leftUserName: {
-      type: 'string',
-      description: 'Имя пользователя слева',
-      defaultValue: 'User A',
-    },
+    leftUserName: {},
     rightUserName: {
       type: 'string',

[Timeout] StringLiteral
src/components/Score/Score.stories.tsx:12:21
     leftUserName: {
       type: 'string',
       description: 'Имя пользователя слева',
-      defaultValue: 'User A',
+      defaultValue: "",
     },
     rightUserName: {

[Timeout] StringLiteral
src/components/Score/Score.stories.tsx:17:21
     rightUserName: {
       type: 'string',
       description: 'Имя пользователя справа',
-      defaultValue: 'User B',
+      defaultValue: "",
     },
     leftPoint: {

[Timeout] ObjectLiteral
src/components/Score/Score.stories.tsx:19:16
       description: 'Имя пользователя справа',
       defaultValue: 'User B',
     },
-    leftPoint: {
-      type: 'number',
-      description: 'Очки пользователя слева',
-      defaultValue: 0,
-    },
+    leftPoint: {},
     rightPoint: {
       type: 'number',

[Timeout] StringLiteral
src/components/Score/Score.stories.tsx:21:20
     },
     leftPoint: {
       type: 'number',
-      description: 'Очки пользователя слева',
+      description: "",
       defaultValue: 0,
     },

[Timeout] ObjectLiteral
src/components/Score/Score.stories.tsx:24:17
       description: 'Очки пользователя слева',
       defaultValue: 0,
     },
-    rightPoint: {
-      type: 'number',
-      description: 'Очки пользователя справа',
-      defaultValue: 0,
-    },
+    rightPoint: {},
   },
 };

[Timeout] ArrowFunction
src/components/Score/Score.stories.tsx:32:18
   },
 };
 
-const Template = (arg) => <Score {...arg} />;
+const Template = () => undefined;
 
 export const Default = Template.bind({});

[Timeout] ObjectLiteral
src/components/Score/Score.stories.tsx:35:16
 const Template = (arg) => <Score {...arg} />;
 
 export const Default = Template.bind({});
-Default.args = {
-  leftUserName: 'User Left',
-  rightUserName: 'User Right',
-  leftPoint: 0,
-  rightPoint: 0,
-};
+Default.args = {};
 

[Timeout] StringLiteral
src/components/Score/Score.stories.tsx:36:17
 
 export const Default = Template.bind({});
 Default.args = {
-  leftUserName: 'User Left',
+  leftUserName: "",
   rightUserName: 'User Right',
   leftPoint: 0,
