[Timeout] StringLiteral
src/components/Text/Text.stories.tsx:10:13
   component: Text,
   argTypes: {
     text: {
-      type: 'string',
+      type: "",
       description: 'Выводимый текст',
       defaultValue: 'Тут могла быть ваша реклама',

[Timeout] StringLiteral
src/components/Text/Text.stories.tsx:11:20
   argTypes: {
     text: {
       type: 'string',
-      description: 'Выводимый текст',
+      description: "",
       defaultValue: 'Тут могла быть ваша реклама',
     },

[Timeout] StringLiteral
src/components/Text/Text.stories.tsx:12:21
     text: {
       type: 'string',
       description: 'Выводимый текст',
-      defaultValue: 'Тут могла быть ваша реклама',
+      defaultValue: "",
     },
     size: {

[Timeout] ObjectLiteral
src/components/Text/Text.stories.tsx:14:11
       description: 'Выводимый текст',
       defaultValue: 'Тут могла быть ваша реклама',
     },
-    size: {
-      type: 'string',
-      description: 'Размер шрифта',
-      defaultValue: 'medium',
-      options: ['medium', 'big'],
-      control: {
-        type: 'radio',
-      },
-    },
+    size: {},
   },
 };

[Timeout] ArrayDeclaration
src/components/Text/Text.stories.tsx:18:16
       type: 'string',
       description: 'Размер шрифта',
       defaultValue: 'medium',
-      options: ['medium', 'big'],
+      options: [],
       control: {
         type: 'radio',

[Timeout] StringLiteral
src/components/Text/Text.stories.tsx:18:27
       type: 'string',
       description: 'Размер шрифта',
       defaultValue: 'medium',
-      options: ['medium', 'big'],
+      options: ['medium', ""],
       control: {
         type: 'radio',

[Timeout] StringLiteral
src/components/Text/Text.stories.tsx:20:15
       defaultValue: 'medium',
       options: ['medium', 'big'],
       control: {
-        type: 'radio',
+        type: "",
       },
     },

[Timeout] ArrowFunction
src/components/Text/Text.stories.tsx:26:18
   },
 };
 
-const Template = (arg) => <Text {...arg} />;
+const Template = () => undefined;
 
 export const Default = Template.bind({});

[Timeout] ObjectLiteral
src/components/Text/Text.stories.tsx:29:16
 const Template = (arg) => <Text {...arg} />;
 
 export const Default = Template.bind({});
-Default.args = {
-  text: 'Пример текста',
-};
+Default.args = {};
 
