[Timeout] ArrowFunction
src/navigation/Navigation.tsx:7:31
 import { Floor } from '../components/Floor/Floor';
 import { NotFound } from '../components/NotFound/NotFound';
 
-export const Navigation: FC = () => (
-  <BrowserRouter basename="/react-developer-2023">
-    <Routes>
-      <Route path="/" element={<Enter />} />
-      <Route path="/game" element={<Floor testMode={false} />} />
-      <Route path="*" element={<NotFound />} />
-    </Routes>
-  </BrowserRouter>
-);
+export const Navigation: FC = () => undefined;
 

[Timeout] BooleanLiteral
src/navigation/Navigation.tsx:11:53
   <BrowserRouter basename="/react-developer-2023">
     <Routes>
       <Route path="/" element={<Enter />} />
-      <Route path="/game" element={<Floor testMode={false} />} />
+      <Route path="/game" element={<Floor testMode={true} />} />
       <Route path="*" element={<NotFound />} />
     </Routes>
