[Timeout] ArithmeticOperator
src/components/helper/methods.ts:5:21
  * Получить случайное число в рамках заданного максимума
  * */
 const randomNumber = (maxValue: number) => {
-  return Math.floor(Math.random() * maxValue);
+  return Math.floor(Math.random() / maxValue);
 };
 

[Timeout] StringLiteral
src/components/helper/methods.ts:17:5
   maxPoints: number,
 ) => {
   console.log(
-    `Length: ${length}; fillings: ${fillings}; maxPoints: ${maxPoints}`,
+    ``,
   );
   const result = [];

[Timeout] EqualityOperator
src/components/helper/methods.ts:24:28
   for (let i = 0; i < length; i++) {
     const max = randomNumber(100);
 
-    if (fillings >= 100 || fillings > max) {
+    if (fillings >= 100 || fillings >= max) {
       // Если вернулся 0, то в итоговый массив добавляем 1, чтобы соответствовать проценту наполнения
       result.push(randomNumber(maxPoints + 1) || 1);

[Timeout] ConditionalExpression
src/components/helper/methods.ts:24:9
   for (let i = 0; i < length; i++) {
     const max = randomNumber(100);
 
-    if (fillings >= 100 || fillings > max) {
+    if (true) {
       // Если вернулся 0, то в итоговый массив добавляем 1, чтобы соответствовать проценту наполнения
       result.push(randomNumber(maxPoints + 1) || 1);

[Timeout] LogicalOperator
src/components/helper/methods.ts:26:19
 
     if (fillings >= 100 || fillings > max) {
       // Если вернулся 0, то в итоговый массив добавляем 1, чтобы соответствовать проценту наполнения
-      result.push(randomNumber(maxPoints + 1) || 1);
+      result.push(randomNumber(maxPoints + 1) && 1);
     } else {
       result.push(0);

[Timeout] ConditionalExpression
src/components/helper/methods.ts:26:19
 
     if (fillings >= 100 || fillings > max) {
       // Если вернулся 0, то в итоговый массив добавляем 1, чтобы соответствовать проценту наполнения
-      result.push(randomNumber(maxPoints + 1) || 1);
+      result.push(true);
     } else {
       result.push(0);

[Timeout] BlockStatement
src/components/helper/methods.ts:27:12
     if (fillings >= 100 || fillings > max) {
       // Если вернулся 0, то в итоговый массив добавляем 1, чтобы соответствовать проценту наполнения
       result.push(randomNumber(maxPoints + 1) || 1);
-    } else {
-      result.push(0);
-    }
+    } else {}
   }
 
