[Timeout] ConditionalExpression
src/components/styles/components.tsx:5:5
 
 const handleWidth = (size: string) => {
   switch (size) {
-    case '5x5':
-      return '630px';
+    case '5x5':
     case '4x4':
       return '490px';

[Timeout] ConditionalExpression
src/components/styles/components.tsx:7:5
   switch (size) {
     case '5x5':
       return '630px';
-    case '4x4':
-      return '490px';
+    case '4x4':
     default:
       return '370px';

[Timeout] ConditionalExpression
src/components/styles/components.tsx:9:5
       return '630px';
     case '4x4':
       return '490px';
-    default:
-      return '370px';
+    default:
   }
 };

[Timeout] StringLiteral
src/components/styles/components.tsx:21:40
   font-family: monospace;
 `;
 
-export const StyledLabel = styled.label`
-  font-size: 20px;
-  width: 100%;
-  padding: 10px;
-  font-family: monospace;
-`;
+export const StyledLabel = styled.label``;
 
 export const StyledForm = styled.form`

[Timeout] StringLiteral
src/components/styles/components.tsx:39:42
   border-radius: 4px;
 `;
 
-export const StyledButton = styled.button`
-  width: 93%;
-  margin-left: 15px;
-  padding: 5px;
-  outline: none;
-  border: none;
-  border-radius: 4px;
-  box-shadow: 0 1px 1px rgba(0, 0, 0, 0.55);
-  font-family: monospace;
-  font-size: 1em;
-  letter-spacing: 2px;
-  text-transform: uppercase;
-  cursor: pointer;
-  user-select: none;
-  transition: 0.2s;
-  background-color: #f9cd0b;
-
-  &:hover {
-    transform: scale(1.05);
-  }
-
-  &:active {
-    box-shadow: none;
-  }
-`;
+export const StyledButton = styled.button``;
 
 export const StyledCenteredDiv = styled.div`

[Timeout] StringLiteral
src/components/styles/components.tsx:65:44
   }
 `;
 
-export const StyledCenteredDiv = styled.div`
-  display: flex;
-  justify-content: center;
-  margin: 20px;
-`;
+export const StyledCenteredDiv = styled.div``;
 
 export const StyledFloorDiv = styled.div<{ size: string }>`

[Timeout] StringLiteral
src/components/styles/components.tsx:71:59
   margin: 20px;
 `;
 
-export const StyledFloorDiv = styled.div<{ size: string }>`
-  display: flex;
-  flex-wrap: wrap;
-  width: ${({ size = '3x3' }) => handleWidth(size)};
-  height: ${({ size = '3x3' }) => handleWidth(size)};
-`;
+export const StyledFloorDiv = styled.div<{ size: string }>``;
 
 export const StyledP = styled.p`

[Timeout] ArrowFunction
src/components/styles/components.tsx:74:12
 export const StyledFloorDiv = styled.div<{ size: string }>`
   display: flex;
   flex-wrap: wrap;
-  width: ${({ size = '3x3' }) => handleWidth(size)};
+  width: ${() => undefined};
   height: ${({ size = '3x3' }) => handleWidth(size)};
 `;

[Timeout] ArrowFunction
src/components/styles/components.tsx:75:13
   display: flex;
   flex-wrap: wrap;
   width: ${({ size = '3x3' }) => handleWidth(size)};
-  height: ${({ size = '3x3' }) => handleWidth(size)};
+  height: ${() => undefined};
 `;
 
