[Timeout] ArrowFunction
src/lesson-10/easy2.ts:40:30
       fullfillmentDate: Date;
     };
 
-export const getOrderState = (order: Order): Order['state'] => order.state;
+export const getOrderState = () => undefined;
 
